[
  {
    "id": "p1",
    "title": "Minimal Portfolio",
    "goal": "The goal of this portfolio is to showcase my continuous growth as a developer by sharing what I’m learning, reflecting weekly, explaining key concepts I’ve mastered, and building mini projects. It demonstrates consistency, curiosity, and real progress over time.",
    "tools": [
      "Next.js (App Router)",
      "TailwindCSS v3",
      "DaisyUI",
      "Node.js FS Module"
    ],
    "learned": "Building a 'Local CMS': I learned how to use Next.js API routes (`app/api/content`) to read and write directly to the local filesystem, creating a functional Admin Dashboard without needing a database.\n\nTheming: I explored Tailwind CSS and DaisyUI themes to create multiple visual modes (Lofi, Nord, Dark) that users can switch between.\n\nNext.js App Router: Gained deep practice with Server Components for the public pages (fast, SEO-friendly) vs Client Components for the interactive Admin dashboard.",
    "link": "https://github.com/Chizanum/E-Portfolio"
  },
  {
    "title": "E-commerce app",
    "goal": "The goal of this project is to build a functional e-commerce application that allows users to browse products, add items to a cart, and complete purchases through a smooth and secure checkout process.\n",
    "tools": [
      "react-native",
      "axios",
      "mongo-Db",
      "tailwind css",
      "daisy-ui",
      "lucide react",
      "node js",
      "express js",
      "react"
    ],
    "learned": "Through this project, I learned how to build and connect a full-stack application using React, React Native, Node.js, Express, and MongoDB. I gained hands-on experience structuring backend APIs, handling client–server communication with Axios, and managing data flow between the frontend and database. I also improved my understanding of component-based architecture, asynchronous operations, and error handling, while using Tailwind CSS, DaisyUI, and Lucide React to create a consistent and user-friendly interface. Overall, the project helped me understand how real-world applications are designed, built, and debugged across both frontend and backend layers.",
    "link": "https://github.com/Chizanum/ecommerce",
    "id": "1770230416762"
  },
  {
    "title": "Swamped",
    "goal": "A mobile task manager app that saves user data locally using asynchronous functions to ensure data is stored persistently without slowing down the app.",
    "tools": [
      "React Native",
      "AsyncStorage",
      "JavaScript Promises / async-await",
      "Expo",
      "TypeScript"
    ],
    "learned": "I learned how to build a mobile task manager app that smoothly saves and retrieves user data locally by leveraging asynchronous functions, ensuring the app stays responsive and data persists across sessions without relying on the internet.",
    "link": "https://github.com/Chizanum/swamped",
    "id": "1770233288784"
  },
  {
    "title": "Wallet-app",
    "goal": "A mobile app that securely authenticates users and integrates with databases to accurately track, save, and manage their expenses and income, providing a dynamic, real-time dashboard that visually displays financial insights and helps users make smarter money decisions.",
    "tools": [
      "React Native",
      "Clerk(authentication)",
      "Rest api's",
      "PostgreSQL",
      "Expo",
      "typescript",
      "tailwind-css",
      "native-wind"
    ],
    "learned": "I learned how to build a mobile finance app that securely authenticates users and uses a robust backend database like PostgreSQL to store and manage detailed expense and income data.",
    "link": "https://github.com/Chizanum/wallet-app",
    "id": "1770233597016"
  },
  {
    "title": "ECHO - Learning AI System",
    "goal": "A conversational AI that learns from its mistakes through self-evaluation and memory-based improvement. Powered by local LLM (Ollama + Llama 3.2) for true intelligence, ECHO generates intelligent responses, evaluates its own quality, stores low-scoring responses in memory, and continuously improves future responses by applying lessons from past mistakes.",
    "tools": [
      "Python",
      "Flask",
      "Ollama",
      "Llama 3.2 3B",
      "React",
      "Vite",
      "",
      "Tailwind CSS",
      "DaisyUI",
      "JavaScript"
    ],
    "learned": "I learned how to build a self-improving AI system that uses local LLMs for intelligent response generation and self-evaluation. I integrated Ollama with Llama 3.2 to create a completely free and private AI that learns from its mistakes by storing low-scoring responses in memory and using them as context for future improvements. I also learned how to build a beautiful React frontend with Tailwind CSS and DaisyUI, and how to create a Flask REST API that connects the AI backend with the web interface.",
    "link": "https://github.com/Chizanum/Echo",
    "id": "1770408160515"
  }
]